/**
 * All Rights Reserved
 */
package net.loyintean.blog.poetry;

import java.util.ArrayList;
import java.util.List;

/**
 * 平水韵
 *
 * @author Snoopy
 * @since 2018年2月5日
 */
class FlatWaterRhyme implements Rhyme {

    private List<Node> rhymes;

    /**
     * 初始化平水韵
     */
    public FlatWaterRhyme() {
        this.rhymes = new ArrayList<>(27);
        this.rhymes.add(new Node("一东",
            "东中同童僮铜桐峒筒瞳潼衷忠盅虫冲终忡崇嵩菘戎绒弓躬宫穹融雄熊穷冯风枫疯丰充隆窿空公功工攻蒙蒙朦瞢笼胧栊咙懵聋珑砻泷蓬逢篷洪荭红虹鸿丛翁嗡匆葱聪骢通棕烘崆璁"));

        this.rhymes.add(new Node("二冬",
            "冬咚彤农秾侬宗淙锺钟供龙重从茏舂松淞冲纵容榕蓉溶庸佣慵封胸凶匈汹雍邕痈浓脓恭逢缝峰锋丰蜂烽葑踪茸蛩邛筇懵跫蚣喁悰熔"));

        this.rhymes.add(new Node("三江", "江缸窗邦双泷庞豇扛杠腔梆桩幢降撞"));

        this.rhymes.add(new Node("四支",
            "支枝肢移垂陂碑奇宜仪皮儿离施知思驰为池规危吹骑遗夷犁师姿迟龟眉悲之芝时诗棋旗辞词期祠基疑姬丝司葵医帷滋持随痴维卮麋螭麾墀弥醾慈肌脂雌披嬉尸狸炊湄篱兹差疲茨卑亏蕤歧岐谁斯澌私窥熙欺疵赀羁彝髭颐资糜饥衰锥姨夔祗涯伊追蓍缁萁箕椎罴篪萎匙脾坻嶷治骊綦怡尼漪牺饴而鸱推陲魑锤缡璃羸帔蘼芪畸羲曦欹猗崎崖筛狮蛳绥虽粢瓷嫠痍惟唯耆逵岿丕毗枇貔楣霉辎蚩嗤媸飔埘莳鲥鹚笞漓贻禧噫其琪祺麒栀鹂累踟琵祁骐訾咨睢馗胝鳍蛇陴淇丽厮氏僖嘻琦怩熹孜罹磁痿隋逶郦嵋椅縻迤"));

        this.rhymes
            .add(new Node("五微", "微薇晖辉徽挥韦围帏违闱霏菲妃飞非扉肥威祈畿机衣几讥玑稀希依归饥矶欷诽绯晞葳巍沂圻颀"));

        this.rhymes.add(new Node("六鱼",
            "鱼渔初书舒居裾琚车渠蕖余誉疏舆胥狙锄蔬予梳虚嘘墟徐猪闾庐驴诸储除滁蜍如畲淤妤苴菹沮徂龉茹榈於祛蘧疽蛆醵纾樗躇欤据"));

        this.rhymes.add(new Node("七虞",
            "虞愚娱隅无芜巫于衢癯瞿氍儒襦濡须需朱珠株诛朱铢蛛殊俞瑜榆愉逾渝窬谀腴区躯驱岖趋龉扶符凫芙雏敷麸夫肤纡输枢厨俱驹模谟摹蒲逋胡湖瑚乎壶狐弧孤辜姑觚菰徒途涂荼图屠奴吾梧吴租卢鲈炉芦颅垆蚨孥帑苏酥乌污枯粗都茱侏姝禺拘嵎蹰桴俘臾萸吁滹瓠糊醐呼沽酤泸舻轳鸬驽匍葡铺菟诬呜迂盂竽趺毋孺酴鸪骷刳蛄晡蒱葫呱蝴劬殂猢郛孚"));

        this.rhymes.add(new Node("八齐",
            "齐黎犁梨妻萋凄堤低题提蹄啼骊鸡稽兮倪霓西栖犀嘶撕梯鹂鼙赍迷泥溪蹊圭闺携畦嵇跻奚脐醯黧蠡醍鹈奎批砒睽荑篦齑藜猊蜺鲵羝氐笄"));

        this.rhymes.add(new Node("九佳", "佳街鞋牌柴钗差崖涯偕阶皆谐骸排乖怀淮豺侪埋楷霾斋槐睚崽秸揩挨俳娃"));

        this.rhymes.add(new Node("十灰",
            "灰恢魁隈回徊槐梅枚玫媒煤雷颓崔催摧堆陪杯醅嵬推诙裴培盔偎煨瑰茴追胚徘坯桅傀儡莓开哀埃台苔抬该才材财裁栽哉来莱灾猜孩徕骀胎唉垓陔挨皑呆腮"));

        this.rhymes.add(new Node("十一真",
            "真因茵辛新薪晨辰臣人仁神亲申身宾滨槟缤邻鳞麟珍瞋尘陈春泯津秦频颦濒银垠筠谆巾民岷珉贫莼淳醇纯唇伦轮沦抡匀旬巡驯钧均榛莘遵循甄宸纶椿鹑屯呻粼嶙辚磷呻伸绅寅姻荀询洵峋氤恂嫔彬皴娠闽纫湮肫逡菌臻豳夤嗔"));

        this.rhymes
            .add(new Node("十二文", "文纹蚊云氛纷芬焚坟群裙君军勤斤筋勋薰曛醺芸耘芹欣氲荤汶闻汾殷雯分贲纭昕熏"));

        this.rhymes.add(new Node("十三元",
            "元原源沅鼋园袁猿垣烦蕃樊喧萱暄冤怨言轩藩媛援辕番繁翻幡璠鸳鹓蜿湲爰掀燔谖魂浑温孙门尊存论敦墩炖暾蹲豚村屯囤盆奔昏痕根恩吞荪扪昆鲲坤仑婚阍髡馄喷狲饨臀跟瘟飧棔樽"));

        this.rhymes.add(new Node("十四寒",
            "寒韩丹单安冠看观难鞍漫翰餐檀坛滩弹残汗干肝竿阑栏澜兰刊丸完桓纨端湍酸团攒官鸾銮峦欢宽盘蟠叹邯郸摊玕拦珊狻鼾杆跚姗殚箪瘅谰獾倌棺剜潘盘般蹒瘢磐瞒谩馒鳗钻抟邗"));

        this.rhymes.add(new Node(
            "寒韩丹单安冠看观难鞍漫翰餐檀坛滩弹残汗干肝竿阑栏澜兰刊丸完桓纨端湍酸团攒官鸾銮峦欢宽盘蟠叹邯郸摊玕拦珊狻鼾杆跚姗殚箪瘅谰獾倌棺剜潘盘般蹒瘢磐瞒谩馒鳗钻抟邗-",
            "十五删"));

        this.rhymes.add(new Node("一先",
            "先前千阡笺天坚肩贤弦玄鲜烟莲怜连田填传研巅扇燕扁便鬈宣年颠牵妍眠渊涓捐娟边编悬泉迁仙钱煎然延筵毡旃蝉缠嬛廛联篇偏绵全镌穿川缘鸢旋船涎鞭专圆圈员乾虔愆权拳椽焉嫣鞯褰搴铅舷跹鹃筌痊诠悛邅禅婵躔颛燃涟琏翩骈癫阗钿沿蜒胭芊鳊胼滇佃畋咽湮狷蠲蔫骞膻棉拴荃籼砖挛儇璇卷单溅犍"));

        this.rhymes.add(new Node("二萧",
            "萧箫挑貂刁凋雕迢条髫调蜩枭浇聊辽寥撩寮僚料尧宵消燎霄绡销超朝潮嚣骄娇蕉焦椒饶硝烧遥徭摇谣瑶韶昭招镳瓢苗猫腰桥乔娆妖飘逍潇鸮骁祧鹪鹩缭獠嘹夭幺邀要姚樵谯憔标飚嫖漂剽佻龆苕岧噍哓跷侥了魈峣描钊轺桡铫鹞翘枵侨窑礁"));

        this.rhymes
            .add(new Node("三肴", "肴巢交郊茅嘲钞包胶苞梢姣庖匏坳敲胞抛蛟崤鵁鞘稍抄蝥咆哮凹淆教跑艄捎爻咬铙茭炮泡鲛刨抓"));

        this.rhymes.add(new Node("四豪",
            "豪劳毫操髦绦刀萄猱褒桃糟旄袍挠蒿涛皋号陶鳌曹遭羔糕高搔毛艘滔骚韬缫膏牢醪逃濠壕饕洮淘叨啕篙熬遨翱嗷臊嗥尻鏖螯獒敖牦漕嘈槽掏唠涝捞痨芼"));

        this.rhymes.add(new Node("五歌",
            "歌多罗河戈阿和波科柯陀娥蛾鹅萝荷何过磨螺禾珂蓑婆坡呵哥轲沱鼍拖驼跎佗颇峨俄摩么娑那莎迦疴苛蹉嵯驮箩逻锣哪挪锅诃窠蝌髁倭涡窝讹陂鄱皤魔梭唆骡挼靴瘸搓哦瘥酡磋"));

        this.rhymes.add(new Node("六麻",
            "麻花霞家茶华沙车牙蛇瓜斜邪芽嘉瑕纱鸦遮叉奢涯巴耶嗟遐加笳赊槎差蟆骅虾葭袈裟砂衙呀琶咱耙芭杷笆疤爬葩些佘鲨查茬楂娃渣爹挝咤拿椰珈跏枷迦痂茄桠丫哑划哗夸胯抓洼呱"));

        this.rhymes.add(new Node("七阳",
            "阳杨扬香乡光昌堂章慷相张王房浪芳塘妆常嫦凉霜长创丧藏当量场将飏强央泱抢泱鸯秧嫱床方肓浆觞梁娘庄黄仓皇装殇襄骧湘箱缃忘望芒尝偿樯枪坊囊郎狼铓唐狂肠康冈苍匡荒遑行妨棠翔良航倡伥羌戕庆姜僵缰疆粮穰墙桑刚祥详洋徉佯粱羊伤汤鲂樟彰漳璋猖商防筐煌隍凰蝗惶璜廊裆珰沧岗纲亢吭潢钢盲簧忙茫傍汪臧琅庠裳昂障糖疡锵杭邙赃滂禳攘瓤螳踉眶炀阊彭蒋亡殃蔷镶孀搪旁彷胱磅膀螃徨"));

        this.rhymes.add(new Node("八庚",
            "庚更羹盲横觥彭亨英烹平丁枰京惊荆明盟鸣荣莹兵兄卿生甥笙牲擎鲸迎行衡耕萌甍宏闳茎罂莺樱泓橙争筝清情晴精睛菁晶旌盈楹瀛嬴赢营婴缨贞成盛城诚呈程酲声征正轻名令并倾萦琼峥嵘撑粳坑铿撄鹦黥蘅澎膨棚浜坪苹评钲伧檠嘤轰铮狰宁狞瞪绷怦璎砰氓鲭侦柽蛏茔赪茕赓嬛黉瞠"));

        this.rhymes.add(new Node("九青",
            "青经泾形陉亭庭廷霆蜓停丁仃馨星腥醒惺俜灵龄呤玲铃伶零听冥溟铭瓶屏萍荧萤扃坰蜻硎苓聆瓴翎娉婷宁暝瞑螟猩钉疔叮厅町泠棂囹羚蛉咛型邢"));

        this.rhymes.add(new Node("十蒸",
            "蒸烝承丞惩澄陵凌绫菱冰膺鹰应蝇绳升缯凭乘胜兴仍兢矜征徴徵称登灯僧憎增曾矰层能弘朋鹏肱薨腾藤恒罾崩滕誊崚嶒姮塍冯症簦瞢凝棱楞"));

        this.rhymes.add(new Node("十一尤",
            "尤邮优忧尤流旒留骝榴刘由油游猷悠攸牛修羞馐秋周州洲舟酬雠柔俦畴筹稠丘邱抽瘳遒逑收鸠搜驺愁休呕囚求裘仇浮谋牟眸侔矛侯喉猴讴鸥楼陬偷头投钩沟幽纠啾楸蚯踌绸惆勾娄琉疣犹邹兜呦咻貅球蜉蝣辀帱阄瘤硫浏庥湫泅酋瓯啁飕鍪篌抠篝诌骰偻沤蝼髅搂欧彪掊虬揉蹂抔不瓿缪"));

        this.rhymes.add(new Node("十二侵",
            "侵沉深寻浔临林霖针箴斟沈心琴禽擒衾钦吟今襟金音阴淫岑簪壬任歆森禁祲喑琛涔骎参忱淋妊掺参椹郴芩檎琳蟫愔喑黔嵚砧"));

        this.rhymes.add(
            new Node("十三覃", "覃潭参骖南楠男谙庵含涵函岚蚕探贪耽眈龛堪谈甘三酣柑惭蓝担簪谭昙坛婪戡颔痰篮褴蚶憨泔聃邯蟫毵"));

        this.rhymes.add(
            new Node("十四盐", "盐檐廉帘嫌严占髯谦奁纤恹签瞻蟾炎添兼缣沾尖潜阎镰黏淹钳甜恬拈砭詹蒹歼黔钤佥觇崦渐鹣腌襜阉"));

        this.rhymes.add(new Node("十五咸", "咸缄岩谗衔帆函衫杉监凡馋芟搀喃嵌掺巉"));

    }

    /**
     * @return
     * @author Snoopy
     * @see net.loyintean.blog.poetry.Rhyme#getRhymeName()
     * @since 2018年2月5日
     */
    @Override
    public String getRhymeName() {
        return "平水韵";
    }

    @Override
    public Node getNode(int i) {
        return this.rhymes.get(i % this.rhymes.size());
    }
}
